import pygame


class Transition:

    def __init__(
        self,
        distance=720,
        duration=2.0
    ):

        # ==========================================
        # مقدار حرکت عمودی
        # ==========================================

        self.distance = float(
            distance
        )

        # ==========================================
        # مدت انتقال
        # ==========================================

        self.duration = float(
            duration
        )

        # ==========================================
        # مقدار فعلی حرکت
        # ==========================================

        self.offset = 0.0

        # ==========================================
        # زمان
        # ==========================================

        self.elapsed = 0.0

        # ==========================================
        # وضعیت
        # ==========================================

        self.active = False

        self.finished = False

    # =================================================
    # شروع
    # =================================================

    def start(self):

        self.offset = 0.0

        self.elapsed = 0.0

        self.active = True

        self.finished = False

    # =================================================
    # بروزرسانی
    # =================================================

    def update(self, dt):

        if not self.active:

            return

        if dt < 0:

            dt = 0

        self.elapsed += dt

        # ------------------------------------------
        # درصد پیشرفت
        # ------------------------------------------

        progress = (
            self.elapsed
            / self.duration
        )

        # ------------------------------------------
        # پایان
        # ------------------------------------------

        if progress >= 1.0:

            progress = 1.0

            self.active = False

            self.finished = True

        # ------------------------------------------
        # حرکت از پایین به بالا
        #
        # offset از 0 تا 720 می‌رود
        # ------------------------------------------

        self.offset = (
            self.distance
            * progress
        )

        # ------------------------------------------
        # مقدار پیکسلی
        # ------------------------------------------

        self.pixel_offset = int(
            self.offset
        )

    # =================================================
    # مقدار حرکت
    # =================================================

    def get_offset(self):

        return int(
            self.offset
        )

    # =================================================
    # وضعیت
    # =================================================

    def is_active(self):

        return self.active

    # =================================================

    def is_finished(self):

        return self.finished